In [11]:
import pandas as pd

In [31]:
df  = pd.read_csv("titanic.csv")

In [32]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [33]:
df.columns

Index(['PassengerId', 'Name', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [34]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 1, inplace = True)

In [35]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [36]:
target = df.Survived

In [37]:
inputs = df.drop('Survived', axis = 1)

In [38]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [39]:
inputs = pd.concat([inputs,dummies],axis ='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [40]:
inputs.drop('Sex',axis =1 ,inplace =True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [41]:
inputs.Age.isnull().sum()

177

In [42]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [43]:
inputs.Age.isnull().sum()

0

In [60]:
from sklearn.model_selection import train_test_split
X_train, X_test , y_train, y_test = train_test_split(inputs , target, test_size = 0.2)

In [61]:
len(X_train)

712

In [62]:
len(X_test)

179

In [63]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [64]:
model.fit(X_train ,y_train)

GaussianNB()

In [65]:
model.score(X_test , y_test)

0.8268156424581006

In [66]:
X_test[:10]

     Pclass        Age     Fare  female  male
669       1  29.699118  52.0000       1     0
384       3  29.699118   7.8958       0     1
386       3   1.000000  46.9000       0     1
646       3  19.000000   7.8958       0     1
255       3  29.000000  15.2458       1     0
639       3  29.699118  16.1000       0     1
744       3  31.000000   7.9250       0     1
162       3  26.000000   7.7750       0     1
389       2  17.000000  12.0000       1     0
592       3  47.000000   7.2500       0     1

In [67]:
y_test[:10]

669    1
384    0
386    0
646    0
255    1
639    0
744    1
162    0
389    1
592    0
Name: Survived, dtype: int64

In [68]:
model.predict(X_test[:10])

array([1, 0, 0, 0, 1, 0, 0, 0, 1, 0], dtype=int64)

In [69]:
model.predict_proba(X_test[:10])

array([[0.00849885, 0.99150115],
       [0.98843775, 0.01156225],
       [0.9646322 , 0.0353678 ],
       [0.98629569, 0.01370431],
       [0.10654239, 0.89345761],
       [0.98874335, 0.01125665],
       [0.98858115, 0.01141885],
       [0.98789711, 0.01210289],
       [0.04167261, 0.95832739],
       [0.98854864, 0.01145136]])